{
  "metadata": {
    "total_size": 15475417088
  },
  "weight_map": {
    "model.layers.0.attention.wo.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.0.attention.wqkv.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.0.attention_norm.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.0.feed_forward.w1.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.0.feed_forward.w2.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.0.feed_forward.w3.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.0.ffn_norm.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.1.attention.wo.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.1.attention.wqkv.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.1.attention_norm.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.1.feed_forward.w1.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.1.feed_forward.w2.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.1.feed_forward.w3.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.1.ffn_norm.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.10.attention.wo.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.10.attention.wqkv.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.10.attention_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.10.feed_forward.w1.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.10.feed_forward.w2.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.10.feed_forward.w3.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.10.ffn_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.11.attention.wo.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.11.attention.wqkv.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.11.attention_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.11.feed_forward.w1.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.11.feed_forward.w2.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.11.feed_forward.w3.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.11.ffn_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.12.attention.wo.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.12.attention.wqkv.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.12.attention_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.12.feed_forward.w1.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.12.feed_forward.w2.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.12.feed_forward.w3.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.12.ffn_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.13.attention.wo.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.13.attention.wqkv.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.13.attention_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.13.feed_forward.w1.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.13.feed_forward.w2.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.13.feed_forward.w3.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.13.ffn_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.14.attention.wo.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.14.attention.wqkv.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.14.attention_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.14.feed_forward.w1.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.14.feed_forward.w2.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.14.feed_forward.w3.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.14.ffn_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.15.attention.wo.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.15.attention.wqkv.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.15.attention_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.15.feed_forward.w1.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.15.feed_forward.w2.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.15.feed_forward.w3.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.15.ffn_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.16.attention.wo.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.16.attention.wqkv.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.16.attention_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.16.feed_forward.w1.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.16.feed_forward.w2.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.16.feed_forward.w3.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.16.ffn_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.17.attention.wo.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.17.attention.wqkv.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.17.attention_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.17.feed_forward.w1.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.17.feed_forward.w2.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.17.feed_forward.w3.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.17.ffn_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.18.attention.wo.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.18.attention.wqkv.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.18.attention_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.18.feed_forward.w1.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.18.feed_forward.w2.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.18.feed_forward.w3.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.18.ffn_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.19.attention.wo.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.19.attention.wqkv.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.19.attention_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.19.feed_forward.w1.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.19.feed_forward.w2.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.19.feed_forward.w3.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.19.ffn_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.2.attention.wo.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.2.attention.wqkv.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.2.attention_norm.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.2.feed_forward.w1.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.2.feed_forward.w2.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.2.feed_forward.w3.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.2.ffn_norm.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.20.attention.wo.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.20.attention.wqkv.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.20.attention_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.20.feed_forward.w1.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.20.feed_forward.w2.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.20.feed_forward.w3.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.20.ffn_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.21.attention.wo.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.21.attention.wqkv.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.21.attention_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.21.feed_forward.w1.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.21.feed_forward.w2.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.21.feed_forward.w3.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.21.ffn_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.22.attention.wo.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.22.attention.wqkv.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.22.attention_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.22.feed_forward.w1.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.22.feed_forward.w2.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.22.feed_forward.w3.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.22.ffn_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.23.attention.wo.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.23.attention.wqkv.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.23.attention_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.23.feed_forward.w1.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.23.feed_forward.w2.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.23.feed_forward.w3.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.23.ffn_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.24.attention.wo.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.24.attention.wqkv.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.24.attention_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.24.feed_forward.w1.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.24.feed_forward.w2.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.24.feed_forward.w3.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.24.ffn_norm.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.25.attention.wo.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.25.attention.wqkv.weight": "pytorch_model-00003-of-00004.bin",
    "model.layers.25.attention_norm.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.25.feed_forward.w1.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.25.feed_forward.w2.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.25.feed_forward.w3.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.25.ffn_norm.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.26.attention.wo.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.26.attention.wqkv.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.26.attention_norm.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.26.feed_forward.w1.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.26.feed_forward.w2.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.26.feed_forward.w3.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.26.ffn_norm.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.27.attention.wo.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.27.attention.wqkv.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.27.attention_norm.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.27.feed_forward.w1.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.27.feed_forward.w2.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.27.feed_forward.w3.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.27.ffn_norm.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.28.attention.wo.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.28.attention.wqkv.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.28.attention_norm.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.28.feed_forward.w1.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.28.feed_forward.w2.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.28.feed_forward.w3.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.28.ffn_norm.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.29.attention.wo.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.29.attention.wqkv.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.29.attention_norm.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.29.feed_forward.w1.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.29.feed_forward.w2.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.29.feed_forward.w3.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.29.ffn_norm.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.3.attention.wo.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.3.attention.wqkv.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.3.attention_norm.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.3.feed_forward.w1.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.3.feed_forward.w2.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.3.feed_forward.w3.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.3.ffn_norm.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.30.attention.wo.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.30.attention.wqkv.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.30.attention_norm.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.30.feed_forward.w1.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.30.feed_forward.w2.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.30.feed_forward.w3.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.30.ffn_norm.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.31.attention.wo.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.31.attention.wqkv.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.31.attention_norm.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.31.feed_forward.w1.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.31.feed_forward.w2.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.31.feed_forward.w3.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.31.ffn_norm.weight": "pytorch_model-00004-of-00004.bin",
    "model.layers.4.attention.wo.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.4.attention.wqkv.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.4.attention_norm.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.4.feed_forward.w1.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.4.feed_forward.w2.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.4.feed_forward.w3.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.4.ffn_norm.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.5.attention.wo.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.5.attention.wqkv.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.5.attention_norm.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.5.feed_forward.w1.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.5.feed_forward.w2.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.5.feed_forward.w3.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.5.ffn_norm.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.6.attention.wo.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.6.attention.wqkv.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.6.attention_norm.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.6.feed_forward.w1.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.6.feed_forward.w2.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.6.feed_forward.w3.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.6.ffn_norm.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.7.attention.wo.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.7.attention.wqkv.weight": "pytorch_model-00001-of-00004.bin",
    "model.layers.7.attention_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.7.feed_forward.w1.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.7.feed_forward.w2.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.7.feed_forward.w3.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.7.ffn_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.8.attention.wo.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.8.attention.wqkv.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.8.attention_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.8.feed_forward.w1.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.8.feed_forward.w2.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.8.feed_forward.w3.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.8.ffn_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.9.attention.wo.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.9.attention.wqkv.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.9.attention_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.9.feed_forward.w1.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.9.feed_forward.w2.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.9.feed_forward.w3.weight": "pytorch_model-00002-of-00004.bin",
    "model.layers.9.ffn_norm.weight": "pytorch_model-00002-of-00004.bin",
    "model.norm.weight": "pytorch_model-00004-of-00004.bin",
    "model.tok_embeddings.weight": "pytorch_model-00001-of-00004.bin",
    "output.weight": "pytorch_model-00004-of-00004.bin"
  }
}
